In [4]:
import pandas as pd
import numpy as np

In [5]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
   .....:                     index=["Ohio", "Colorado", "Utah", "New York"],
   .....:                     columns=["one", "two", "three", "four"])

In [6]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [9]:
data.loc[data.three == 5,"harom"] = 6

In [10]:
data

          one  two  three  four  harom
Ohio        0    1      2     3    NaN
Colorado    4    5      6     7    NaN
Utah        8    9     10    11    NaN
New York   12   13     14    15    NaN

In [11]:
data.drop(columns=["harom"])

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [12]:
data.loc["Ohio"]

one      0.0
two      1.0
three    2.0
four     3.0
harom    NaN
Name: Ohio, dtype: float64

In [14]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),columns=list("abcd"))

In [15]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [17]:
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),columns=list("abcde"))

In [18]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [20]:
df2.loc[3]

a    15.0
b    16.0
c    17.0
d    18.0
e    19.0
Name: 3, dtype: float64

In [22]:
df2.loc[[2,3]]

      a     b     c     d     e
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [26]:
df2.loc[1,"b"] = np.nan

In [27]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [28]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [29]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [30]:
obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])

In [31]:
obj

d    0
a    1
b    2
c    3
dtype: int32

In [32]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [34]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)),index=["three","one"],columns=list("dabc"))

In [35]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [36]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [37]:
frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4